package ru.job4j;
/** Документация для пакетов:
 * archive
 * chat
 * exam
 * helpers
 * io
 * search
 *
 * @author Daniil Loputevs
 * @version v1.0
 * @since 05.03.2020.
 * Last upd: 05.03.20.
 *
 *
 * archive - Классы:
 * Args - Задача: написать Класс Args симулируя его настоящие поведение.
 *--шаблон для запуска программы через cmd через ключи.
 *
 * Zip - Класс для архивации директорий.
 *-- Задача: написать метод для архивации директории в: project.zip
 *
 * chat - Классы:
 * Bot - Задача: сделать консольный чат. ввод от пользователя, - ответ Случайная фраза из файла с Фразами.
 *-- чат-бот, который поддерживает 3 команды: 1) "стоп", 2) "продолжить", 3) "закончить".
 * Input - Интерфейс описывающий Ввод строк в бота.
 * ConsoleInput - оформленный ввод строк от пользователя через консоль.
 * StubInput - ввод строк за пользователя в тестах. Делается через Конструктор класса.
 * Output - оформленный Вывод Ответа бота куда-то, ещё. (работает, как буфер поток)
 *
 * exam - Классы:
 * RevertLinkedList - Перевернуть Одно-Связанный список, перевёртывая ссылки со Следующего эл. на Предыдущий эл.
 *-- Эффективный переворот Одно-Связанный список.
 *
 * helpers - Классы:
 * IOHelper - Класс содержащий универсальные и вспомогательные методы для работы с IO.
 * StringHelper - Класс содержащий универсальные и вспомогательные методы для работы со String.
 *
 * io - Классы:
 * Analizy - Задача: Считать содержимое файла analise_input, проанализировать когда сервер работал и записать ответ.
 * Config - Задача: Считать содержимое файла configuration.properties и сохранить "Настройки" во внутреннюю Map
 *
 * io - Классы:
 * Search - Задача: Написать метод, который возвращает список всех файлов с конкретным расширением.
 */